So update data is column includes renaming the column name , replacing it , changing to upper case and lower case

In [1]:
import pandas as pd

result={
    "Name":["Operating Systems","Machine Learning","Data Science","Artificial Neural Network","Computer Vision"],
    "Marks":[98,98,96,95,97],
    "Grades":["S","S","A","S","A"]
}

result=pd.DataFrame(result)
result

                        Name  Marks Grades
0          Operating Systems     98      S
1           Machine Learning     98      S
2               Data Science     96      A
3  Artificial Neural Network     95      S
4            Computer Vision     97      A

In [2]:
#now I want to change the columns name into lowercase 

result.columns

Index(['Name', 'Marks', 'Grades'], dtype='object')

In [3]:
#we use list comprehension for that 

result.columns = [x.lower() for x in result.columns]
result

                        name  marks grades
0          Operating Systems     98      S
1           Machine Learning     98      S
2               Data Science     96      A
3  Artificial Neural Network     95      S
4            Computer Vision     97      A

In [4]:
# I want to replace the name of columns , we can simply do this 

result.columns = ['Subject Name','Marks Obtained','Grades Obtained']
result

                Subject Name  Marks Obtained Grades Obtained
0          Operating Systems              98               S
1           Machine Learning              98               S
2               Data Science              96               A
3  Artificial Neural Network              95               S
4            Computer Vision              97               A

In [5]:
# putting underscore at the place of space in coolumn names

result.columns=result.columns.str.replace(" ","_")
result

                Subject_Name  Marks_Obtained Grades_Obtained
0          Operating Systems              98               S
1           Machine Learning              98               S
2               Data Science              96               A
3  Artificial Neural Network              95               S
4            Computer Vision              97               A

In [6]:
#doing in lowercase column's name

result.columns=[x.upper() for x in result.columns]
result

                SUBJECT_NAME  MARKS_OBTAINED GRADES_OBTAINED
0          Operating Systems              98               S
1           Machine Learning              98               S
2               Data Science              96               A
3  Artificial Neural Network              95               S
4            Computer Vision              97               A

In [7]:
#now if we have to use rename function then here we use 
#we use dictionary and treat the previous name as key and new name as value

result.rename(columns={"SUBJECT_NAME":"name",
                "MARKS_OBTAINED":"marks",
                "GRADES_OBTAINED":"grades"})
result

#but we can see nothing changed , this is because we need to add inplace = True here also

                SUBJECT_NAME  MARKS_OBTAINED GRADES_OBTAINED
0          Operating Systems              98               S
1           Machine Learning              98               S
2               Data Science              96               A
3  Artificial Neural Network              95               S
4            Computer Vision              97               A

In [8]:
result.rename(columns={"SUBJECT_NAME":"name",
                "MARKS_OBTAINED":"marks",
                "GRADES_OBTAINED":"grades"},inplace=True)   #inplace=true added
result

                        name  marks grades
0          Operating Systems     98      S
1           Machine Learning     98      S
2               Data Science     96      A
3  Artificial Neural Network     95      S
4            Computer Vision     97      A

## Access rows

In [10]:
#we will keep the dataset same , now I want to print 2nd row

result.iloc[1,[0,1,2]]

name      Machine Learning
marks                   98
grades                   S
Name: 1, dtype: object

In [11]:
#i want to access third row grade only

result.iloc[2,[-1]]

grades    A
Name: 2, dtype: object